[
    {
        "title": "I hate ShadowHeart and refuse to party with her.",
        "author": "Calm-Chemist-6982",
        "content": "Idk about y'all but I find her so annoying. I hate that she's the cleric option. I'm not far into the game and I guess I could get a hireling.\n\nI like all the other characters but I can't figure out which of them to multiclass as a cleric since they all have low wisdom.\n\nI've decided to forgo magical healing this playthrough and just do an all guy run. Just me, Gale <3, Astarion and Wyll. Idk if it's wise but I simply focus on healing through resting and potions I find.\n\nHopefully I figure out how alchemy works soon so I can create my own healing pots.",
        "score": 1,
        "url": "https://www.reddit.com/r/BaldursGate3/comments/1dapxdu/i_hate_shadowheart_and_refuse_to_party_with_her/",
        "num_comments": 2,
        "upvote_ratio": 0.67,
        "is_nsfw": false,
        "created_utc": 1717805624.0,
        "linked_page_title": "Reddit - Dive into anything"
    },
    {
        "title": "My ending in Baldur's gate 3 Spoilers ahead",
        "author": "GuidanceNervous3330",
        "content": "my ending. Spoilers ahead\n\n\n\n1. Orpheus became a mind flayer. I persuaded him to stay alive to see the future of his people.\n\n2.  Wyll decided to become the blade of Avernus and together with Karlach they slayed countless enemies for 6 months before the final party. His dad is alive and is doing a good job as a leader of BG. Also he is free from Mizora and is no longer a warlock. there was a loophole in the contract.\n\n3. Lae'zel is now leading her people against the  bad queen. She is now a negotiator and still kills enemies. The egg hatched and she plans on letting kid choose what it wants to be when it grows up. \n\n4.  Shadowheart became my romantic companion. She decided to remove her curse. \n\n\n\n5. Astarion becomes a good vampire, her siblings died in the ceremony, The 7k+ vamps died too.\n\n\n\n6. Halsin became the leader of the map in act 2, The 2 kids that we save with him are okay. In the final party he said that the grove now has a new good leader. The map in act 2 is doing great  according to him and is now fertile. refugees are welcome to live in the tower. we are invited to visit. earlier in the game i saved him in the lair of Orin.  \n\n\n\n7. Karlach was invited by Wyll to go in Avernus so that she can continue to live and she agreed. Now while they were slaying enemies there they found map to place that can useful in finding a cure for her condition. \n\n\n\n8. Minsc is alive and now friends with the Nine fingers \n\n\n\n9. Jaheira is okay and her kids too.\n\n\n\n10.  Gale is now a teacher. His bomb got cured because he returned the crown to the goddess.\n\n11. Wilbur is now the new leader of the his clan. I saved all the Gondians. The two clans are at peace now.  I also save Omelum. \n\n12.  I saved Hope. and defeated the boss there. Yurgir sided with the enemy boss.\n\n13. I saved the last light inn. Isobel was not kidnapped. Dammon now has a shop in BG\n\n14.  The baby owlbear may have died from its wound but the dog is alive and was present in the last party. \n\n\n\n15. The emperor(Baladur)  died with the brain.\n\n\n\n16. Volo joined the last party.\n\n17. Saved the four NPC from the murderer group quest. We save the elephant too. \n\n\n\n18. Defeated the HAG in act 1 and 3\n\n\n\n19 Rolan became the boss in the tower and her siblings will join him there.\n\n\n\n20. Mol is alive and Arabell became a wizard or sorc\n\n21. I helped the hag survivors but the kid did not survive sadly. I was not able save enough to go back in time.\n\n\n\n22. the guild leader, counselor florick , the vampire slayer group, Aily, isobel, Zevlor and etc are present in the last battle. Voss helped too.\n\n23. Saved and helped the artist. \n\n24. Used none lethal attack against The flaming first soldier when I was on my way to fight Gortash ()\n\n\n\n25. Killed all the goblin npc. \n\n\n\n26. Drank the str poition in moonrise tower and get attacked by its make in act 3\n\n\n\n27. Mynthara did not surivive act 1\n\n\n\n28. Alfira now plays in the roof top a bar in BG\n\n\n\n29. I never used the tadpole.\n\n\n\n30. I helped the 3 zombie and slayed the Immortal mummy. \n\n\n\n31. I also sided with the leader of the myconid.\n\n\n\n32. I returned the 10k gold.  \n\n\n\n33. I received the blue dress from the water religion.\n\n\n\n34.  Gortash parents did not survive act 3\n\n\n\n35. Destroyed the fireworks factory.\n\n\n\n36. I used the code to destroy the factory of robots.\n\n\n\n\n\n\n\nthat's all that I can remember. I wanted to share my exp to everyone. Please share your own exp too. I wanna read them all. thankyou!\n\n",
        "score": 5,
        "url": "https://www.reddit.com/r/BaldursGate3/comments/1dapmr4/my_ending_in_baldurs_gate_3_spoilers_ahead/",
        "num_comments": 0,
        "upvote_ratio": 1.0,
        "is_nsfw": false,
        "created_utc": 1717804778.0,
        "linked_page_title": "Reddit - Dive into anything"
    },
    {
        "title": "Did I f up my Shadowheart Romance?",
        "author": "Crazy_Cat_Lady_1992",
        "content": "I totally didn't know I was supposed to talk to her in Wyrms crossing to get the \"learn how to swim\"-scene and now I already moved on to killing Cazador and freeing Shadowhearts Parents...\n\nDo I have to reload or can I still get that scene somehow?\n\npls help \\^\\^\" It's my first time romancing her and I do want to have all scenes if possible.",
        "score": 2,
        "url": "https://www.reddit.com/r/BaldursGate3/comments/1dapf3m/did_i_f_up_my_shadowheart_romance/",
        "num_comments": 0,
        "upvote_ratio": 1.0,
        "is_nsfw": false,
        "created_utc": 1717804160.0,
        "linked_page_title": "Reddit - Dive into anything"
    },
    {
        "title": "What secrets should I not miss on my 3rd playthrough?",
        "author": "thecainman",
        "content": "I’ve played a goody two shoes Gale who saves the world and Astarion loves me forever.\n\nI played a power hungry Durge who refuses daddy’s gift and ends up controlling the Absolute and ruling supreme.\n\nFor my third playthrough I’m playing with a full party multiplayer. We’re all Seldarine drow. I’m Dark Urge again and a bard.\n\nFor this run I wanna make sure I experience the really hidden path and the random things you wouldn’t normally do…\n\nI’m thinking to accept daddy’s gift this time as I’m playing a good drow who eventually gives into her heritage but what other things you recommend I do a certain way? Or places to explore that may be ignored normally?\n\n(I already have Gale’s hand for example. Anything I can do with it?)\n\n",
        "score": 5,
        "url": "https://www.reddit.com/r/BaldursGate3/comments/1dap63b/what_secrets_should_i_not_miss_on_my_3rd/",
        "num_comments": 3,
        "upvote_ratio": 1.0,
        "is_nsfw": false,
        "created_utc": 1717803422.0,
        "linked_page_title": "Reddit - Dive into anything"
    },
    {
        "title": "Making Ketheric surrender",
        "author": "Electrical-Print1839",
        "content": "If you try to convince Ketheric to surrender, Aylin flies in and ruins it. But what happens if Aylin had been killed? Does Ketheric truly surrender?",
        "score": 2,
        "url": "https://www.reddit.com/r/BaldursGate3/comments/1dap2jl/making_ketheric_surrender/",
        "num_comments": 1,
        "upvote_ratio": 1.0,
        "is_nsfw": false,
        "created_utc": 1717803141.0,
        "linked_page_title": "Reddit - Dive into anything"
    },
    {
        "title": "First playthrough",
        "author": "Cosmic-Cherub",
        "content": "Hey everyone, I’ve been thinking of getting the game. I’ve seen some videos on it like the 4 halflings and 4 bards lol. Other than that it’s pretty much been the same scenes but other peoples clips. I’ve been purposely avoiding to much so that if I do get it even though I seen whats possible I can go and experience it myself. I don’t want “meta” builds and this class is the best because of this blah blah. I don’t want to know how to get every companion and where to get them even though I’ve seen the vid recommended. I don’t what to know op weapons or things like that. \n\nI just want to know if I do pick the game up, is it better to do a play through of an original character I make or the dark urge. I’m not interested in playing as the other characters at least not as a first playthrough anyway. However dark urge with being able to be customized seems interesting, however is this better for a potential first play through or should I just do a complete original character first?\n\nAlso how many characters can be made, is there a limit. I’m definitely guessing it will be a big one but not sure if it specifically says or what.\n\nOne last thing is there only physicals released for when there was a digital deluxe edition, so I’m guessing limited. Cause I don’t actually see it on GameStop.",
        "score": 2,
        "url": "https://www.reddit.com/r/BaldursGate3/comments/1daoyoq/first_playthrough/",
        "num_comments": 4,
        "upvote_ratio": 0.75,
        "is_nsfw": false,
        "created_utc": 1717802833.0,
        "linked_page_title": "Reddit - Dive into anything"
    },
    {
        "title": "Any artists that do commissioned Tav portraits?",
        "author": "sh_tcactus",
        "content": "Hi yall. I’m looking for an artist who will do a digital portrait of my Tav. Does anyone have any recommendations of artists with commissions open right now?",
        "score": 4,
        "url": "https://www.reddit.com/r/BaldursGate3/comments/1daoeew/any_artists_that_do_commissioned_tav_portraits/",
        "num_comments": 0,
        "upvote_ratio": 1.0,
        "is_nsfw": false,
        "created_utc": 1717801266.0,
        "linked_page_title": "Reddit - Dive into anything"
    },
    {
        "title": "Sunlight on Cazador",
        "author": "carinoeva",
        "content": "Did the sunlight method against cazador get patched recently? It’s my first time fighting him and it sounded fun so I wanted to try it out, but every time I get near enough to inflict sunlight sensitivity on him he either heals himself repeatedly(out of combat) or him/his minions sees me and starts combat. I’m playing modded with party limit begone so it’s really a nonissue but I can’t figure out why it’s not working for me. I’ve tried having shadowheart cast daylight both on a character and as a sphere and it just always ends in initiating combat rather than slowing taking away cazador’s health\n\nupdate: \n\nstill can’t figure out why it won’t work, but ended up defeating him in 2 turns by doing the following:\n\n1. placed 4 smoke powder barrels around him, move characters in party towards the edge of either side of the platform\n2. cast daylight sphere and initiate combat\n3. got lucky and my tav (lvl 12 fighter) had a higher initiative than him, used a fire arrow to explode the barrels which took like half his health, then just used all the extra attacks i could and action surge to keep shooting him.\n4. his turn, took radiant damage and he attacked wyll and then wyll took him out with hellish rebuke\n5. defeated his minions and continued the story. Hope this helps anyone else that may be struggling!",
        "score": 2,
        "url": "https://www.reddit.com/r/BaldursGate3/comments/1dao877/sunlight_on_cazador/",
        "num_comments": 2,
        "upvote_ratio": 0.75,
        "is_nsfw": false,
        "created_utc": 1717800803.0,
        "linked_page_title": "Reddit - Dive into anything"
    },
    {
        "title": "Is it obvious when it is time to save Last Light?",
        "author": "Puppyg47",
        "content": "I just got to Last Light Inn and I know you can save it. How obvious is it? Will I have to seek it out, or will it just be thrown in my face at some point? \n\nI can't find nothing about this in Google, so\n\nThank you to everyone in advance.",
        "score": 0,
        "url": "https://www.reddit.com/r/BaldursGate3/comments/1dao7dr/is_it_obvious_when_it_is_time_to_save_last_light/",
        "num_comments": 3,
        "upvote_ratio": 0.5,
        "is_nsfw": false,
        "created_utc": 1717800739.0,
        "linked_page_title": "Reddit - Dive into anything"
    },
    {
        "title": "If romances had been written by Bioware or Owlcat...",
        "author": "Relevant-Use1897",
        "content": "It’s a safe bet that not all of the companions would have been pansexual.\n\nThis is a criticism that had already been raised by some Dragon Age 2 players. We can say that is really realistic but, on other hand, it avoids potential frustration (or having to install a mod). I like the structure with companions only attracted to a specific gender (with some bi romance included however), but I understand why a lot of people prefer the method chosen by Larian for BG3.\n\nAll this to say, I thought a little about what distribution I would have made if I had to write the romances. It's a pure headcanon based on my interpretation of their personalities and backgrounds. If you have another vision of this, please share it in the comments.\n\nhttps://preview.redd.it/560q62g4985d1.png?width=1140&format=png&auto=webp&s=678ba80643981d01488f7315cf53f50496aae5c2",
        "score": 0,
        "url": "https://www.reddit.com/r/BaldursGate3/comments/1dao6dj/if_romances_had_been_written_by_bioware_or_owlcat/",
        "num_comments": 5,
        "upvote_ratio": 0.15,
        "is_nsfw": false,
        "created_utc": 1717800656.0,
        "linked_page_title": "Reddit - Dive into anything"
    },
    {
        "title": "How?!",
        "author": "MustyCowpoke",
        "content": "How are people replacing character models for different scenes please somebody help I need to know… For scientific reasons 😅",
        "score": 1,
        "url": "https://www.reddit.com/r/BaldursGate3/comments/1dao581/how/",
        "num_comments": 1,
        "upvote_ratio": 0.67,
        "is_nsfw": false,
        "created_utc": 1717800566.0,
        "linked_page_title": "Reddit - Dive into anything"
    },
    {
        "title": "Astarion won’t confess",
        "author": "Prior_Imagination453",
        "content": "I've spent way too much time trying to get this ridiculously fickle elf to confess. I killed Yurgir, spoke to Raphael about the scars, have Astarion at Very High, entered moonrise, and completed both the Hosue of Healing and Halsin quests (heard they help?) and he still won't give me the confession. Tips?",
        "score": 2,
        "url": "https://www.reddit.com/r/BaldursGate3/comments/1dao43a/astarion_wont_confess/",
        "num_comments": 4,
        "upvote_ratio": 0.75,
        "is_nsfw": false,
        "created_utc": 1717800476.0,
        "linked_page_title": "Reddit - Dive into anything"
    },
    {
        "title": "Goblin Children in Baldur's Gate 3...",
        "author": "Ok_Butterfly8845",
        "content": "",
        "score": 2,
        "url": "https://www.youtube.com/shorts/WbKzBlbZpAM",
        "num_comments": 0,
        "upvote_ratio": 1.0,
        "is_nsfw": false,
        "created_utc": 1717799834.0,
        "linked_page_title": "Goblin Children in Baldur's Gate 3 be like #shorts #baldursgate3 #gaming - YouTube"
    },
    {
        "title": "Made an oopsie in my first durge playthrough ",
        "author": "kekzuna",
        "content": "Actually despite it being my first playthrough i wanted to be a good durge as in not slaughter people and stuff since I know it's an option, but I've just killed the bard girl at camp \nAm I cooked? Or can I still continue being a good guy ",
        "score": 5,
        "url": "https://www.reddit.com/r/BaldursGate3/comments/1danr1u/made_an_oopsie_in_my_first_durge_playthrough/",
        "num_comments": 5,
        "upvote_ratio": 0.86,
        "is_nsfw": false,
        "created_utc": 1717799495.0,
        "linked_page_title": "Reddit - Dive into anything"
    },
    {
        "title": "Umm isn't Aylin showing up for the final fight?",
        "author": "Personal_Disaster_84",
        "content": "Does anyone know why I can't call up Aylin for the final fight? She didn't show up to the high hall. Is there a limit on the number I can have?\n\nhttps://preview.redd.it/za8qi1um585d1.png?width=875&format=png&auto=webp&s=b3067cc0bba504ba319a45caf102260749e71dfd\n\nhttps://preview.redd.it/1kj9bg7t585d1.png?width=419&format=png&auto=webp&s=e100ff346aba9b262c64ca6a740239bcbc96ab3a",
        "score": 2,
        "url": "https://www.reddit.com/r/BaldursGate3/comments/1daniw5/umm_isnt_aylin_showing_up_for_the_final_fight/",
        "num_comments": 1,
        "upvote_ratio": 0.75,
        "is_nsfw": false,
        "created_utc": 1717798884.0,
        "linked_page_title": "Reddit - Dive into anything"
    },
    {
        "title": "Lady Esther Not Giving Quest",
        "author": "strangetopquark",
        "content": "So when I first talked to Esther, I couldn't decide whether to accept the quest for stealing an egg and chose the trade option in her dialogue instead. I know I read somewhere that you could go back and get the quest when you wanted to. But now when I click on her, there is only a dialogue asking me if i have reconsidered/considered her proposition to steal the egg. When I click that, my character only asks why she wanted to steal the egg anyway. There is no dialogue option at all for her to give me the quest. Have I locked myself out of it? Is there a way to reset my dialogue with her?",
        "score": 2,
        "url": "https://www.reddit.com/r/BaldursGate3/comments/1dani8w/lady_esther_not_giving_quest/",
        "num_comments": 2,
        "upvote_ratio": 1.0,
        "is_nsfw": false,
        "created_utc": 1717798838.0,
        "linked_page_title": "Reddit - Dive into anything"
    },
    {
        "title": "I need the vinyl",
        "author": "shpanky",
        "content": "I am going through a lot of life stuff right now and missed out on the preorder, but really want the vinyl 3LP release.  Does anyone have any tips on how to get one in the most financially responsible way? LOL",
        "score": 1,
        "url": "https://www.reddit.com/r/BaldursGate3/comments/1danf2q/i_need_the_vinyl/",
        "num_comments": 0,
        "upvote_ratio": 1.0,
        "is_nsfw": false,
        "created_utc": 1717798607.0,
        "linked_page_title": "Reddit - Dive into anything"
    },
    {
        "title": "Tiny party portraits for big parties (read first comment).",
        "author": "Thomas7249",
        "content": "",
        "score": 1,
        "url": "https://i.redd.it/pj0n7722285d1.jpeg",
        "num_comments": 5,
        "upvote_ratio": 1.0,
        "is_nsfw": false,
        "created_utc": 1717798354.0,
        "linked_page_title": "No title found"
    },
    {
        "title": "Why does my Beard look like that?",
        "author": "MasterRymes",
        "content": "",
        "score": 1,
        "url": "https://i.redd.it/750rfkqx385d1.png",
        "num_comments": 3,
        "upvote_ratio": 0.67,
        "is_nsfw": false,
        "created_utc": 1717798197.0,
        "linked_page_title": "No title found"
    },
    {
        "title": "I crafted Shadowheart's camp outfit (pic: Shae_photographe)",
        "author": "Shienra",
        "content": "",
        "score": 21,
        "url": "https://www.reddit.com/gallery/1dan7wo",
        "num_comments": 1,
        "upvote_ratio": 0.93,
        "is_nsfw": false,
        "created_utc": 1717798083.0,
        "linked_page_title": "No title found"
    },
    {
        "title": "Tactician mode achievement",
        "author": "CptCrunchZTime",
        "content": "I've seen plenty of discussion about it and changing at the end, but what I would like to no is I am on Tactician mode, I made a save in the Nautiloid, lowered the difficulty, killed Commander Zhalk, then loaded the previous save that is still on tactician mode.\n\nAm I still good for the achievement or do I have to start over",
        "score": 1,
        "url": "https://www.reddit.com/r/BaldursGate3/comments/1dan7j5/tactician_mode_achievement/",
        "num_comments": 3,
        "upvote_ratio": 1.0,
        "is_nsfw": false,
        "created_utc": 1717798056.0,
        "linked_page_title": "Reddit - Dive into anything"
    },
    {
        "title": "Fastest way to get oathbreaker?",
        "author": "GoodDayMyFineFellow",
        "content": "I want to do a character that would have broken their oath a long time before the start of the game. Obviously I can’t do oathbreaker straight from the start but I’d like to get to oathbreaker as fast as possible. Where can I find a place to break my oath in act 1? ",
        "score": 3,
        "url": "https://www.reddit.com/r/BaldursGate3/comments/1dan6u5/fastest_way_to_get_oathbreaker/",
        "num_comments": 14,
        "upvote_ratio": 1.0,
        "is_nsfw": false,
        "created_utc": 1717798008.0,
        "linked_page_title": "Reddit - Dive into anything"
    },
    {
        "title": "Myrkul Fight (Tactician)",
        "author": "AngronApofis",
        "content": "I.... Am having a lot of trouble with this one.\n\nI think my party composition is just hard countered. Its my first run so I had no idea about the Myrkul fight or how his abilities worked: unfortunately that means the only bludgeoning weapon in my inventory is the blood of lathander.\n\nMy party is Shart, Karlach, Wyll, and Dark Urge. Dark Urge being a Wizard 1 Bard 7 (all my party is leve 8).\n\nAfter many tries, my strategy is Wyll casting Hunger of Hadar on Myrkul, and Shart holding Melee with Spirit Guardians, but this takes incredibly long to kill it. I dont deal enough damage to it and Nightsong does nothing to it. Karlach deals half damage which means she is on coocoon cleaning duty. Durge does what he can but its not much considering he is a bard, sometimes he throws fireball, he counters Mind Flayer dominate person if needed on the first stage...\n\nAll i can do to cut Myrkuls healing is throw some antiheal arrows at him but its hard to land them and they dont last long.\n\nAm I just fucked?",
        "score": 1,
        "url": "https://www.reddit.com/r/BaldursGate3/comments/1dan60s/myrkul_fight_tactician/",
        "num_comments": 1,
        "upvote_ratio": 1.0,
        "is_nsfw": false,
        "created_utc": 1717797947.0,
        "linked_page_title": "Reddit - Dive into anything"
    }
]