[
    {
        "title": "Water marks?",
        "author": "fonzybaby",
        "content": "These marks popped up over the past couple weeks or so, any idea what they are? It's not wet at all. ",
        "score": 1,
        "url": "https://www.reddit.com/gallery/1daor5o",
        "num_comments": 0,
        "upvote_ratio": 1.0,
        "is_nsfw": false,
        "created_utc": 1717802251.0,
        "linked_page_title": "No title found"
    },
    {
        "title": "How to patch Engineered Hardwood Floor gouges due to dropping metal objects?",
        "author": "JustStranger6803",
        "content": "",
        "score": 1,
        "url": "https://i.redd.it/aazco1t0f85d1.jpeg",
        "num_comments": 0,
        "upvote_ratio": 1.0,
        "is_nsfw": false,
        "created_utc": 1717802062.0,
        "linked_page_title": "No title found"
    },
    {
        "title": "Weird cables?",
        "author": "Altruistic-Ideal-141",
        "content": "Just about to move into a new flat, and there are weird steel cables that run from one side of the loft space the whole way across the ceiling to the other side. They don't look strong enough to be structural? Only thought is that they could have been used to hold something that blocked out light from the skylights? The flat was previously a shop, so could it have been a safety measure?\n\nDoes anyone have any ideas what these could be, and if it would be ok to remove them?\n\n(Apologies I don't have better pictures, these are from the property listing)\n\nThanks in advance!",
        "score": 1,
        "url": "https://www.reddit.com/gallery/1daohsa",
        "num_comments": 2,
        "upvote_ratio": 0.66,
        "is_nsfw": false,
        "created_utc": 1717801525.0,
        "linked_page_title": "No title found"
    },
    {
        "title": "Does anyone know what these are called?",
        "author": "ChiReddit85",
        "content": "These are on the storm door holding the glass pane in place. ",
        "score": 1,
        "url": "https://i.redd.it/0wrqza87d85d1.jpeg",
        "num_comments": 0,
        "upvote_ratio": 1.0,
        "is_nsfw": false,
        "created_utc": 1717801297.0,
        "linked_page_title": "No title found"
    },
    {
        "title": "Soffit blown out twice on a recent built home",
        "author": "Gearlesso_0",
        "content": "Hello, I don’t know if this is the right page to post this question on. But, we had a piece of our soffit blown out by strong winds on a recently built two storey home. \n\nThe first time it was blown away completely, and the builder was notified. They installed a new piece. But now again the soffit from the same area as before is starting to peel away. \n\nShould we just contact the builder again and have them fix this. But then we are afraid next time, when our warranty ends, it may happen again, and it won’t be an easy fix on our own. \n\nWe want to know if it would be better if we contact our lawyer and negotiate some sort of life long warranty with the builder on the soffit or something. \n\nAny help/advise will be appreciated. ",
        "score": 2,
        "url": "https://www.reddit.com/r/Home/comments/1dao82b/soffit_blown_out_twice_on_a_recent_built_home/",
        "num_comments": 1,
        "upvote_ratio": 1.0,
        "is_nsfw": false,
        "created_utc": 1717800793.0,
        "linked_page_title": "Reddit - Dive into anything"
    },
    {
        "title": "Hello. Once I build a deck, is there a way I can set my posts like that of a utility Pol so that it lasts awhile? There is almost no available information nowadays on utility poles. I just want to know how they set it, so i can do that with my deck posts! Thanks! ",
        "author": "DonaldsBush",
        "content": "",
        "score": 1,
        "url": "https://www.reddit.com/r/Home/comments/1danh4w/hello_once_i_build_a_deck_is_there_a_way_i_can/",
        "num_comments": 0,
        "upvote_ratio": 1.0,
        "is_nsfw": false,
        "created_utc": 1717798759.0,
        "linked_page_title": "Reddit - Dive into anything"
    },
    {
        "title": "What’s the best way to get rid of the smell of cigarettes that comes from your apartment neighbor?",
        "author": "afro_rellio",
        "content": "They usually smoke in the bathroom and it flows right into mine. It fills up my apartment if I leave the door open. I’ve tried closing the drains, having a wax burner, an automatic air freshener, etc and nothing works. Help please 😩",
        "score": 2,
        "url": "https://www.reddit.com/r/Home/comments/1danceh/whats_the_best_way_to_get_rid_of_the_smell_of/",
        "num_comments": 0,
        "upvote_ratio": 1.0,
        "is_nsfw": false,
        "created_utc": 1717798408.0,
        "linked_page_title": "Reddit - Dive into anything"
    },
    {
        "title": "Termite Identification?",
        "author": "HydraHYD",
        "content": "",
        "score": 1,
        "url": "https://www.reddit.com/gallery/1dan1bp",
        "num_comments": 1,
        "upvote_ratio": 1.0,
        "is_nsfw": false,
        "created_utc": 1717797623.0,
        "linked_page_title": "No title found"
    },
    {
        "title": "Will these shelves prevent me from properly removing shower walls, since im supposed to cut around them? Thank you. ",
        "author": "DonaldsBush",
        "content": "And if I do, how would I go about repairing it afterword? Thank you. ",
        "score": 2,
        "url": "https://i.redd.it/6r3yw7t6z75d1.jpeg",
        "num_comments": 1,
        "upvote_ratio": 1.0,
        "is_nsfw": false,
        "created_utc": 1717796584.0,
        "linked_page_title": "No title found"
    },
    {
        "title": "Ants nesting along house foundation/driveway",
        "author": "Appropriate_Job_9988",
        "content": "Ants (small, not carpenter) have taken up residence beneath my driveway where the house foundation meets it. They have many holes stretching most of the ~50’ length. I do not see any teal damage, just the excavated dirt they pull put while tunneling (I hope)?  Should I be concerned that they will damage the house foundation?",
        "score": 1,
        "url": "https://www.reddit.com/gallery/1dam86u",
        "num_comments": 0,
        "upvote_ratio": 1.0,
        "is_nsfw": false,
        "created_utc": 1717795403.0,
        "linked_page_title": "No title found"
    },
    {
        "title": "Concern about the floor collapsing?",
        "author": "Infinites-",
        "content": "I own a single-family house and rent it out to a tenant and his family. The house was built in 1947. Currently, the living room is hardwood floor. The tenant often invites neighbors over to hang out in the living room upstairs on the second floor almost everyday. \n\nThe living room floor is made out of wood - not concrete. There's also three big couches in the living room, one on each side. In total, there's probably 15 people hanging out in the living room almost everyday. On the other side of the living room, there's a huge stack of items. They're using it like it's a storage room/closet.\n\nI'm concerned the wood floor of the living room isn't sturdy enough to support all of this weight and that one day, the entire floor is going to collapse and break because it isn't concrete and having 15 people, a pile of storage, and 3 large couches seems extremely heavy.\n\nShould I be concerned about the sustainability of the floor?",
        "score": 1,
        "url": "https://www.reddit.com/r/Home/comments/1dam5g9/concern_about_the_floor_collapsing/",
        "num_comments": 1,
        "upvote_ratio": 1.0,
        "is_nsfw": false,
        "created_utc": 1717795214.0,
        "linked_page_title": "Reddit - Dive into anything"
    },
    {
        "title": "I feel like a fool. What do these numbers mean? ",
        "author": "ClementineTeri",
        "content": "So, I set the setback temp to 16°c as that’s the coolest I want the house to get. \n\nThere’s currently a 15°c and a 19.5°c on the screen. Which one is the temperature of the rooms and what does the other one mean? \nWe moved in recently and I still don’t get it. ",
        "score": 8,
        "url": "https://i.redd.it/io8jdejkr75d1.jpeg",
        "num_comments": 30,
        "upvote_ratio": 0.73,
        "is_nsfw": false,
        "created_utc": 1717794024.0,
        "linked_page_title": "No title found"
    },
    {
        "title": "A raise in foundation question ",
        "author": "Bash-er33",
        "content": "Recently has a pro come out and measured the elevation to see if a part of foundation is sinking. To our surprise, the suspected area is 3/4” higher and everywhere else was flat. \n\nInspecting the foundation, the area with the rise had a crack and digging into the crack there was a metal plate (as what we can see) the pro guy says it might have been a previous fix. And about 2 years before having it become a issue. Under the house, he couldn’t tell what was going on in that area. There isn’t a tree around that area to rule out as tree root. \n\nLike other concrete, I thought there would be rebars. Not a metal plate. Does anyone know why this is? Or make sense of how its repaired and why it would rise? \n",
        "score": 1,
        "url": "https://www.reddit.com/r/Home/comments/1dalhfy/a_raise_in_foundation_question/",
        "num_comments": 0,
        "upvote_ratio": 1.0,
        "is_nsfw": false,
        "created_utc": 1717793513.0,
        "linked_page_title": "Reddit - Dive into anything"
    },
    {
        "title": "Accent Wall",
        "author": "Dangerous_Feedback28",
        "content": "Hey all, looking to paint this a different color. Should this be painted with a paint brush only or a small roller and paint brush? And please provide recommendations brush/roller or both. Thanks. ",
        "score": 0,
        "url": "https://i.redd.it/vg9ix3eko75d1.jpeg",
        "num_comments": 0,
        "upvote_ratio": 0.5,
        "is_nsfw": false,
        "created_utc": 1717793011.0,
        "linked_page_title": "No title found"
    },
    {
        "title": "Should I fill this gap?",
        "author": "Chilgre",
        "content": "Just moved to southern Texas and noticed this gap on the side of the house. Should I fill it in to keep critters out or is it supposed to be there? ",
        "score": 1,
        "url": "https://i.redd.it/nwfrxpzv675d1.jpeg",
        "num_comments": 3,
        "upvote_ratio": 1.0,
        "is_nsfw": false,
        "created_utc": 1717787067.0,
        "linked_page_title": "No title found"
    },
    {
        "title": "House burned down. How much should I expect to collect",
        "author": "andyrobert312",
        "content": "House recently burned down. It had two houses on the property. How much should I expect to collect?",
        "score": 8,
        "url": "https://i.redd.it/h9wli681075d1.jpeg",
        "num_comments": 11,
        "upvote_ratio": 0.83,
        "is_nsfw": false,
        "created_utc": 1717784761.0,
        "linked_page_title": "No title found"
    },
    {
        "title": "Help finding matching moulding",
        "author": "SocialUniform",
        "content": "When we purchased the home this piece had just been replaced because regular foot traffic breaks it. \nI walked as much as I could at the depot and couldn’t find anything that matched it. Am I looking in the wrong places? Do I need to go to a specialty shop? Any direction on a replacement piece here would be helpful. ",
        "score": 1,
        "url": "https://www.reddit.com/gallery/1dahqsu",
        "num_comments": 3,
        "upvote_ratio": 1.0,
        "is_nsfw": false,
        "created_utc": 1717784308.0,
        "linked_page_title": "No title found"
    },
    {
        "title": "Door handle came off ",
        "author": "Rika72",
        "content": "Hey everyone, my door handle came off and is locked from inside, how do I fix this ?",
        "score": 1,
        "url": "https://i.redd.it/e1ytu80tw65d1.jpeg",
        "num_comments": 1,
        "upvote_ratio": 0.67,
        "is_nsfw": false,
        "created_utc": 1717783676.0,
        "linked_page_title": "No title found"
    },
    {
        "title": "Opinion? ",
        "author": "BocaHW202",
        "content": "",
        "score": 2,
        "url": "https://www.reddit.com/gallery/1dag33y",
        "num_comments": 26,
        "upvote_ratio": 0.57,
        "is_nsfw": false,
        "created_utc": 1717781137.0,
        "linked_page_title": "No title found"
    },
    {
        "title": "One of the water pipe constantly making sound",
        "author": "Findekano",
        "content": "So I hear that one of the water pipes at my house is constantly making some kind of sizzling sound, as if there is always water flowing through it, I turned off all the water usage at home and it is still the same. \n\nI checked the water meter and it is spinning pretty fast - I am convinced there is some leaking somewhere. However as I walk through my house and yard I cannot find anything obvious (other than the sound).  I am thinking that I may have to hire a professional to figure this out. \n\nAny suggestions what kind of worker should I hire? should it be a plumber, or handyman, or any other types? \n\nThanks!",
        "score": 1,
        "url": "https://www.reddit.com/r/Home/comments/1dag44j/one_of_the_water_pipe_constantly_making_sound/",
        "num_comments": 0,
        "upvote_ratio": 1.0,
        "is_nsfw": false,
        "created_utc": 1717780449.0,
        "linked_page_title": "Reddit - Dive into anything"
    },
    {
        "title": "Property Deed? document? record?",
        "author": "BornPea5013",
        "content": "Hello,\n\nI'm receiving \"Property Documents\" and \"Property Records\" since I purchased home couple months back. Both mails says \"Deed\" and I have no Idea what these are for and seems like both of them are the exact same documents but the service fees are different. Can anyone explane what these are for? I'm not from the states and this is my first time buying home in the US. \n\nThank you!",
        "score": 1,
        "url": "https://www.reddit.com/r/Home/comments/1dafovl/property_deed_document_record/",
        "num_comments": 3,
        "upvote_ratio": 1.0,
        "is_nsfw": false,
        "created_utc": 1717779432.0,
        "linked_page_title": "Reddit - Dive into anything"
    },
    {
        "title": "Some space left between the bathtub and wall in my new apartment, any ideas what to put here or what to do with it?",
        "author": "Rolie_",
        "content": "",
        "score": 1,
        "url": "https://i.redd.it/d3yjygwnf65d1.jpeg",
        "num_comments": 6,
        "upvote_ratio": 1.0,
        "is_nsfw": false,
        "created_utc": 1717777911.0,
        "linked_page_title": "No title found"
    },
    {
        "title": "3 way switch",
        "author": "AppleAreUnderRated",
        "content": "Alright so I had these two switches in my living room that appear to do nothing. I tested all outlets (top and bottom) and they don’t switch anything. I pop off the covers and realized they are 3 way switches and I’m 99% positive they are for the same switch somewhere. \n\nLooking at the wiring, the first one looks to be wired correctly. However, the second only has the one red traveling wire and one hot attached to the switch. And when I look inside, I can see a hot is wire nutted to a neutral (yellow wire nut). Im no electrician but I’m pretty sure this is wrong and hopefully explains why these switches don’t do anything. \n\nThe question is, how do I rewire the second switch so this setup is correct? Thank you! \n",
        "score": 1,
        "url": "https://www.reddit.com/gallery/1daec74",
        "num_comments": 0,
        "upvote_ratio": 1.0,
        "is_nsfw": false,
        "created_utc": 1717776039.0,
        "linked_page_title": "No title found"
    },
    {
        "title": "Plantation Shutters",
        "author": "Acceptable_Effort_36",
        "content": "Hi, we are having a bathroom reno being done and I wanted to see if anyone knew what this was called?  Showing a photo where the bottom piece (circled) is already installed, and looking to do the same to the bathroom when it’s done.  Wasn’t sure who to call or how much generally it costs to have this molding/framed piece on the bottom of the window.  Thanks for guidance",
        "score": 1,
        "url": "https://www.reddit.com/gallery/1daeavl",
        "num_comments": 3,
        "upvote_ratio": 1.0,
        "is_nsfw": false,
        "created_utc": 1717775953.0,
        "linked_page_title": "No title found"
    },
    {
        "title": "Birds nest in exterior fireplace exhaust",
        "author": "Free_Kashmir123",
        "content": "How do I stop them from building a nest in my exterior vent? It's about 20 feet up so I really don't like climbing up on the ladder to clear their nest every year. \n\n\nI saw [this protective cover](https://www.houzz.com/discussions/2368889/gas-fireplace-exterior-vent-can-i-paint-the-protective-cage) but have no idea where to get it from. Any suggestions? I stuffed steel wool on the sides temporarily but apparently that's a fire hazard, so would like to remove that soon.",
        "score": 1,
        "url": "https://www.reddit.com/r/Home/comments/1dae6p8/birds_nest_in_exterior_fireplace_exhaust/",
        "num_comments": 0,
        "upvote_ratio": 1.0,
        "is_nsfw": false,
        "created_utc": 1717775659.0,
        "linked_page_title": "Reddit - Dive into anything"
    }
]